conger/app/Models/EmployeModel.php

    public function findByEmail(string $email)
    {
        return $this
            ->select('employes.*')
            ->where('email', $email)->where('actif', 1)->first();
---
SELECT `employes`.*
FROM `employes`
WHERE `email` = 'marie.rabe@rh.com'
AND `actif` = 1
 LIMIT 1